export interface IUser {
  id: number,
  name: string
}

export const initialUsersState: IUser[] = [
  {
    id: 1,
    name: 'Михаил Шубкис',
  },
  {
    id: 2,
    name: 'Владимир Чертанов'
  },
  {
    id: 3,
    name: 'Вадим Вмазов'
  },
  {
    id: 4,
    name: 'Мурат Маматов'
  },
  {
    id: 5,
    name: 'Рамиль Исмаилов'
  },
  {
    id: 6,
    name: 'Ильшат Гильмутдинов'
  },
  {
    id: 7,
    name: 'Ришат Гальмутдинов'
  },
  {
    id: 9,
    name: 'Алексей Борзянко'
  },
  {
    id: 11,
    name: 'Николай Бахнув'
  },
  {
    id: 12,
    name: 'Сергей Минаев'
  },
  {
    id: 13,
    name: 'Олег Баранов'
  },
  {
    id: 14,
    name: 'Иван Иванов'
  },
  {
    id: 15,
    name: 'Петр Петров'
  },
  {
    id: 16,
    name: 'Рамазан Мухаметзянов'
  }
]

export const mockUsers = [
  'Михаил Шубкис',
  'Владимир Чертанов',
  'Вадим Вмазов',
  'Мурат Маматов',
  'Алексей Борзянко',
  'Сергей Минаев',
  'Олег Баранов',
  'Иван Иванов',
  'Петр Петров',
]
